Autodesk.Revit.DB.Analysis.MassLevelData.IsValidConceptualConstructionTypeElement(Autodesk.Revit.DB.ElementId)
Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
Remarks:
In the case that 'conceptualConstructionIsByEnergyData' is true, invalidElementId is also acceptable input.
id:
The ElementId to be checked.
Returns:
True if the ElementId is an acceptable conceptual construction type ElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.IsMassFamilyInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if the ElementId is a mass family instance.
document:
The document.
id:
The ElementId to be checked.
Returns:
True if the ElementId is a mass family instance, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.IsEmpty
Indicates if the MassLevelData (Mass Floor) has a geometrical representation.  May not
if the level does not intersect the mass geometry.
Returns:
Returns True if MassLevelData is dimensionless, False otherwise.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionIsByEnergyData
Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized
with the EnergyDataSettings or if it overrides those settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionId
The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input ElementId conceptualConstructionId is not a valid conceptual construction type ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.MaterialId
The ElementId of the visualization material used for the MassLevelData (Mass Floor)
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.OwningMassId
The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.MaterialType
Indicates if the material used for the graphical appearance is by category or a specific material, or
if the material to be used should be taken from the ConceptualConstructionType of the MassLevelData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The material type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.NLevelPerimeter
The perimeter of the intersection of the MassLevelData's level with the mass geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.NLevelFafArea
The surface area of the intersection of the MassLevelData's level with the mass geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.NExteriorSurfaceArea
The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.NVolume
The volume of from the level of this MassLevelData (Mass Floor) to the next in the mass.
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.StrUsage
A String which describes the usage or occupancy type of the level of the MassLevelData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData
MassLevelData is a conceptual representation of an occupiable floor (Mass Floor) in a conceptual building model.
It is defined by associating a particular level with a particular mass element in a Revit project.
Remarks:
MassLevelData reports metrics, such as floor areas, related to conceptual space planning.
MassLevelData contains information, such as ConceptualConstructionType, used as part of the
Conceptual Energy Analytical model.
The MassLevel data geometry is determined by combining all the geometry of a mass into a single geometry, and then
taking the area of intersection with the level of the MassLevelData.
Since:
2012